-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Час створення: Гру 09 2024 р., 20:27
-- Версія сервера: 10.4.32-MariaDB
-- Версія PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `testn`
--

-- --------------------------------------------------------

--
-- Структура таблиці `adress`
--

CREATE TABLE `adress` (
  `ad_id` int(11) NOT NULL,
  `ad_uch_name` varchar(30) NOT NULL,
  `ad_name` varchar(30) NOT NULL,
  `ad_num_tel` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп даних таблиці `adress`
--

INSERT INTO `adress` (`ad_id`, `ad_uch_name`, `ad_name`, `ad_num_tel`) VALUES
(1, 'Yatsyhyn Liubomyr', 'Pylypa Orlyka', 901238);

-- --------------------------------------------------------

--
-- Структура таблиці `class`
--

CREATE TABLE `class` (
  `cl_id` int(11) NOT NULL,
  `cl_name` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп даних таблиці `class`
--

INSERT INTO `class` (`cl_id`, `cl_name`) VALUES
(1, '8-B'),
(2, '8-Г'),
(3, '5-А'),
(4, '5-Б'),
(5, '5-В'),
(6, '5-Г'),
(7, '6-А'),
(8, '6-Б'),
(9, '6-В'),
(11, '7-А'),
(12, '7-Б'),
(13, '7-В'),
(14, '8-А'),
(15, '8-Б'),
(16, '9-А'),
(17, '9-Б'),
(18, '9-В'),
(19, '10-А'),
(20, '10-Б'),
(21, '10-В'),
(22, '11-А'),
(23, '11-Б'),
(24, '11-В'),
(25, ''),
(26, '9-Г'),
(27, '6-Г');

-- --------------------------------------------------------

--
-- Структура таблиці `document`
--

CREATE TABLE `document` (
  `d_id` int(11) NOT NULL,
  `d_st_id` int(11) NOT NULL,
  `d_tup` int(11) NOT NULL,
  `d_seria` varchar(50) NOT NULL,
  `d_nomer` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп даних таблиці `document`
--

INSERT INTO `document` (`d_id`, `d_st_id`, `d_tup`, `d_seria`, `d_nomer`) VALUES
(1, 8372, 0, 'ovosokop', 671772010);

-- --------------------------------------------------------

--
-- Структура таблиці `parants`
--

CREATE TABLE `parants` (
  `p_id` int(11) NOT NULL,
  `p_name` varchar(25) NOT NULL,
  `p_phone` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп даних таблиці `parants`
--

INSERT INTO `parants` (`p_id`, `p_name`, `p_phone`) VALUES
(1, 'Nazar', 2147483647);

-- --------------------------------------------------------

--
-- Структура таблиці `stud`
--

CREATE TABLE `stud` (
  `st_id` int(11) NOT NULL,
  `st_cl_id` int(11) NOT NULL,
  `st_pib` varchar(40) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `st_birsday` varchar(10) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;

--
-- Дамп даних таблиці `stud`
--

INSERT INTO `stud` (`st_id`, `st_cl_id`, `st_pib`, `st_birsday`) VALUES
(2, 1, 'Yatsyshyn Liubomyr', '27-08-2010'),
(3, 1, 'Makashev Olexandr', '01-01-2010'),
(4, 1, 'Pylak Ostap', '11-11-2010'),
(5, 2, 'Stec Maksym', '13-03-2010'),
(6, 2, 'Vika Znak', '23-09-2010'),
(7, 2, 'Andriy Shkraba', '14-02-2010'),
(9, 12, 'Красінський Денис', '04.06.2011'),
(10, 3, 'Блажкевич Анастасія', ''),
(11, 3, 'Боднар Олег', ''),
(13, 3, 'Барильовська Маргарита', ''),
(14, 3, 'Вовк Анна', ''),
(15, 3, 'Волошин Марта', ''),
(16, 3, 'Гнідець Маркіян', ''),
(17, 3, 'Дуб Дамян', ''),
(18, 3, 'Красінський Данило', ''),
(19, 3, 'Летенко Каріна', ''),
(20, 3, 'Лекхар Нестор', ''),
(21, 3, 'Мазяр Данило', ''),
(22, 3, 'Михалко Арсен', ''),
(23, 3, 'Муль Марко', ''),
(24, 3, 'Німилович Владислав', ''),
(25, 3, 'Панкратов Владислав', ''),
(26, 3, 'Паращук Олександра', ''),
(27, 3, 'Риштий Остап', ''),
(28, 3, 'Скотна Варвара', ''),
(29, 3, 'Смакула Вікторія', ''),
(30, 3, 'Сніданко Максим', ''),
(31, 3, 'Стецишин Юрій', ''),
(32, 3, 'Танчук Віталій', ''),
(33, 3, 'Фідик Денис', ''),
(39, 3, 'Фігура Вікторія', ''),
(40, 3, 'Чміль Олександр', ''),
(41, 3, 'Чушак Ілона', ''),
(42, 3, 'Шакалець Анна', ''),
(44, 4, 'Андрієвська Анна', ''),
(45, 4, 'Андрушко Анна', ''),
(46, 4, 'Бенівчак Тимофій', ''),
(47, 4, 'Бігун Артем', ''),
(48, 4, 'Болецький Микола', ''),
(49, 4, 'Бурдельний Дмитро', ''),
(50, 4, 'Думяк Марія', ''),
(51, 4, 'Дягілєва Маріна', ''),
(52, 4, 'Зварич Богдан', ''),
(53, 4, 'Іваненко Діана', ''),
(54, 4, 'Кігічак Матвій', ''),
(55, 4, 'Кобзяк Влад', ''),
(56, 4, 'Костюк Яна', ''),
(57, 4, 'Кушнір Роберт', ''),
(58, 4, 'Лабойко Кароліна', ''),
(59, 4, 'Луценко Маркіян', ''),
(60, 4, 'Назарчук Ростислав', ''),
(61, 4, 'Павлюк Давид', ''),
(62, 4, 'Савка Софія', ''),
(63, 4, 'Сайчук Каміла', ''),
(64, 4, 'Сич Руслан', ''),
(65, 4, 'Соболевська Діана', ''),
(66, 4, 'Тустанівський Давид', ''),
(67, 4, 'Федьків Діана', ''),
(68, 4, 'Чурсіна Евеліна', ''),
(69, 4, 'Юзвак Тетяна', ''),
(70, 4, 'Юрчак Юрій-Павло', ''),
(71, 5, 'Альберда Евеліна', ''),
(72, 5, 'Богумила Камілла', ''),
(73, 5, 'Васюрко Денис', ''),
(74, 5, 'Вороніна Надія', ''),
(75, 5, 'Галелюк Іван', ''),
(76, 5, 'Гівчак Вікторія', ''),
(77, 5, 'Жумірчак Максим', ''),
(78, 5, 'Іваніщева Анастасія', ''),
(79, 5, 'Іваськів Віра', ''),
(80, 5, 'Кириленко Марта', ''),
(81, 5, 'Кобільник Софія-Віра', ''),
(82, 5, 'Костецький Матвій ', ''),
(83, 5, 'Крайчик Ольга', ''),
(84, 5, 'Кретчак Георгій', ''),
(85, 5, 'Кулешко Софія', ''),
(86, 5, 'Купич Кароліна', ''),
(87, 5, 'Лукавська Анна-Марія', ''),
(88, 5, 'Михальчишин Анастасія', ''),
(89, 5, 'Овчаренко Єлизавета', ''),
(90, 5, 'Панчишак Юлія', ''),
(91, 5, 'Петрах Анна', ''),
(92, 5, 'Потикевич Матвій', ''),
(93, 5, 'Савшак Ярина', ''),
(94, 5, 'Сітинська Яніна', ''),
(95, 5, 'Соболь Софія', ''),
(96, 5, 'Созанський Данило', ''),
(97, 5, 'Шнайдер Анна', ''),
(98, 5, 'Шоробур Злата', ''),
(99, 6, 'Андрейко Елеонора', ''),
(100, 6, 'Андрушків Остап', ''),
(101, 6, 'Бечкало Марта', ''),
(102, 6, 'Борис Поліна', ''),
(103, 6, 'Воляр Злата', ''),
(104, 6, 'Гайда Софія', ''),
(105, 6, 'Гордієвич Максим', ''),
(106, 6, 'Городиська Марта', ''),
(107, 6, 'Гром Марта', ''),
(108, 6, 'Джугостран Аліна', ''),
(109, 6, 'Заміщак Аліна', ''),
(110, 6, 'Іваськевич Павло', ''),
(111, 6, 'Карелін Артем', ''),
(112, 6, 'Карпин Марія', ''),
(113, 6, 'Кацан Назарій', ''),
(114, 6, 'Кийко Олександра', ''),
(115, 6, 'Козлова Даря', ''),
(116, 6, 'Кононов Артьом', ''),
(117, 6, 'Медвідь Максим', ''),
(118, 6, 'Пилат Марія', ''),
(119, 6, 'Підвальна Злата', ''),
(120, 6, 'Прокопчук Софія-Марія', ''),
(121, 6, 'Станович Анна', ''),
(122, 6, 'Федуняк Анна', ''),
(123, 6, 'Фоміна Діана', ''),
(124, 6, 'Цвірчак Марта', ''),
(125, 7, 'Білик Христина', ''),
(126, 7, 'Будник Вікторія', ''),
(127, 7, 'Бунь Марія', ''),
(128, 7, 'Бушта Соломія', ''),
(129, 7, 'Возна Софія', ''),
(130, 7, 'Гавронський Олександр', ''),
(131, 7, 'Геремеш Анастасія', ''),
(132, 7, 'Грицик Марта', ''),
(133, 7, 'Дейниченко Марта', ''),
(134, 7, 'Добрянська Наталія', ''),
(135, 7, 'Дубицький Олег', ''),
(136, 7, 'Захарко Віолета', ''),
(137, 7, 'Кахній Олеся', ''),
(138, 7, 'Конарський Максим', ''),
(139, 7, 'Кондрацький Юрій', ''),
(140, 7, 'Коцан Діана', ''),
(141, 7, 'Лоб Анастасія', ''),
(142, 7, 'Майкут Наталія', ''),
(143, 7, 'Мельник Яна-Марія', ''),
(144, 7, 'Мецан Соломія', ''),
(145, 7, 'Саламага Павло', ''),
(146, 7, 'Старух Анна-Марія', ''),
(147, 7, 'Стебельська Софія', ''),
(148, 7, 'Степановська Анна', ''),
(149, 7, 'Федів Анастасія', ''),
(150, 7, 'Федоренко Олена', ''),
(151, 7, 'Хомишин Юля', ''),
(152, 7, 'Чепіль Данило', ''),
(153, 7, 'Шишка Ірина', ''),
(154, 7, 'Щербанік Діана', ''),
(155, 7, 'Ясюра Дарина', ''),
(156, 8, 'Антонюк Арсеній', ''),
(157, 8, 'Височанська Софія', ''),
(158, 8, 'Войтович Ярослав', ''),
(159, 8, 'Волошин Роман', ''),
(160, 8, 'Гринаш Софія', ''),
(161, 8, 'Добош Вікторія', ''),
(162, 8, 'Задорожний Роман', ''),
(163, 8, 'Іванцюра Анастасія', ''),
(164, 8, 'Камаєв Данило', ''),
(165, 8, 'Кізло Андрій', ''),
(166, 8, 'Колодійчик Макар', ''),
(167, 8, 'Коцюба Роксолана', ''),
(168, 8, 'Красногурська Уляна', ''),
(169, 8, 'Курчак Юліана', ''),
(170, 8, 'Кушнір Іван', ''),
(171, 8, 'Маркопольська Кароліна', ''),
(172, 8, 'Маркопольський Олег', ''),
(173, 8, 'Мельничук Володимир', ''),
(174, 8, 'Мищатин Марта', ''),
(175, 8, 'Ортинський Нестор', ''),
(176, 8, 'Пастернак Назар', ''),
(177, 8, 'Семкович Єлизавета', ''),
(178, 8, 'Середницький Владислав', ''),
(179, 8, 'Ставицький Олег', ''),
(180, 8, 'Струналь Віталіна', ''),
(181, 8, 'Терехова Софія', ''),
(182, 8, 'Тиць Владислав', ''),
(183, 8, 'Яворська Марта', ''),
(184, 10, 'Волошин Артур', ''),
(185, 10, 'Грудзинський Владислав', ''),
(186, 10, 'Донцов Данило', ''),
(187, 10, 'Дорошенко Назар', ''),
(188, 10, 'Дудяк Марія', ''),
(189, 10, 'Жидик Владислав', ''),
(190, 10, 'Кігічак Володимир', ''),
(191, 10, 'Кігічак Софія', ''),
(192, 10, 'Кімак Владислав', ''),
(193, 10, 'Ковальницький Арсен', ''),
(194, 10, 'Козяк Христина', ''),
(195, 10, 'Коца Діана-Марія', ''),
(196, 10, 'Кретчак Захар', ''),
(197, 10, 'Кришталь Віталія', ''),
(198, 10, 'Кушнір Віктор', ''),
(199, 10, 'Легедза Соломія', ''),
(200, 10, 'Леонова Аліна', ''),
(201, 10, 'Мартинюк Олександр', ''),
(202, 10, 'Матчишин Павло', ''),
(203, 9, 'Волошин Артур', ''),
(204, 9, 'Грудзинський Владислав', ''),
(205, 9, 'Донцов Данило', ''),
(206, 9, 'Дорошенко Назар', ''),
(207, 9, 'Дудяк Марія', ''),
(208, 9, 'Жидик Владислав', ''),
(209, 9, 'Кігічак Володимир', ''),
(210, 9, 'Кігічак Софія', ''),
(211, 9, 'Кімак Владислав', ''),
(212, 9, 'Ковальницький Арсен', ''),
(213, 9, 'Козяк Христина', ''),
(215, 9, 'Коцан Діана-Марія', ''),
(216, 9, 'Коца Діана-Марія', ''),
(217, 9, 'Кретчак Захар', ''),
(218, 9, 'Кришталь Віталія', ''),
(219, 9, 'Кушнір Віталій', ''),
(220, 9, 'Легедза Соломія', ''),
(221, 9, 'Леонова Аліна', ''),
(222, 9, 'Мартинюк Олександр', ''),
(223, 9, 'Матчишин Павло', ''),
(224, 9, 'Онисько Роман', ''),
(225, 9, 'Паращук Марта', ''),
(226, 9, 'Подобінський Остап', ''),
(227, 9, 'Садовий Олег', ''),
(228, 9, 'Стрілець Матвій', ''),
(229, 9, 'Торський Олег', ''),
(230, 9, 'Трубач Іван', ''),
(231, 9, 'Ульмер Марко', ''),
(232, 9, 'Хомиця Михайло', ''),
(233, 27, 'Авдіянц Гарєгін', ''),
(234, 27, 'Банішевський Андрій', ''),
(235, 27, 'Барна Любомир', ''),
(236, 27, 'Босак Євген', ''),
(237, 27, 'Босак Олександр', ''),
(238, 27, 'Броварська Вікторія', ''),
(239, 27, 'Войтович Анна', ''),
(240, 27, 'Горват Діана', ''),
(241, 27, 'Гринаш Діана', ''),
(242, 27, 'Дорошевич Данило', ''),
(243, 27, 'Дутко Богдан', ''),
(244, 27, 'Зарицький Владислав', ''),
(245, 27, 'Іванців Ярина', ''),
(246, 27, 'Козар Віктрорія', ''),
(247, 27, 'Кулиняк Степан', ''),
(248, 27, '', ''),
(249, 27, 'Летенко Олексій', ''),
(250, 27, 'Лопатчак Михайло', ''),
(251, 27, 'Маліш Анастасія', ''),
(252, 27, 'Мацько Софія', ''),
(253, 27, 'Мєденцов Михайло', ''),
(254, 27, 'Олексяк Дмитро', ''),
(255, 27, 'Пігур Марія', ''),
(256, 27, 'Пільчак Максим', ''),
(257, 27, 'Томин Артем', ''),
(258, 27, 'Хомич Соломія', ''),
(259, 27, 'Чернявський Давид', ''),
(260, 27, 'Чувакова Юстина', ''),
(261, 11, 'Адикевич Оксана', ''),
(262, 11, 'Багрій Вікторія', ''),
(263, 11, 'Багрій Ольга', ''),
(264, 11, 'Бараняк Андрій', ''),
(265, 11, 'Галів Марія', ''),
(266, 11, 'Гарбіч Денис', ''),
(267, 11, 'Гритчак Анна', ''),
(268, 11, 'Гуцело Соломія', ''),
(269, 11, 'Дудич Анастасія', ''),
(270, 11, 'Іваськевич Олег', ''),
(271, 11, 'Кабацька Ангеліна', ''),
(272, 11, 'Коляса Вікторія', ''),
(273, 11, 'Копач Марта', ''),
(274, 11, 'Кушнір Павло', ''),
(275, 11, 'Липа Дмитро', ''),
(276, 11, 'Лірник Микола', ''),
(277, 11, 'Лужецький Максим', ''),
(278, 11, 'Матійчук Олександр', ''),
(279, 11, 'Мецан Марія', ''),
(280, 11, 'Наум Олександр', ''),
(281, 11, 'Нікітенко Єлизавета', ''),
(282, 11, 'Ортинська Ярина', ''),
(283, 11, 'Панчишак Софія', ''),
(284, 11, 'Паращак Юліанна', ''),
(285, 11, 'Понтус Владислав', ''),
(286, 11, 'Проць Ярослав', ''),
(287, 11, 'Пурій Зоряна', ''),
(288, 11, 'Романович Анастасія', ''),
(289, 11, 'Хемич Денис', ''),
(290, 11, 'Хоркавців Олександр', ''),
(291, 11, 'Чайківська Оксана', ''),
(292, 11, 'Шевців Яна', ''),
(293, 11, 'Шлапак Анна', ''),
(294, 12, 'Бандрівський Святослав', ''),
(295, 12, 'Блажкевич Владислав', ''),
(296, 12, 'Богумила Сабріна', ''),
(297, 12, 'Болецький Святослав-Ігор', ''),
(298, 12, 'Бунь Яна', ''),
(299, 12, 'Винницький Іван', ''),
(300, 12, 'Владика Ярослав', ''),
(301, 12, 'Галюк Роман', ''),
(302, 12, 'Головкевич Анна', ''),
(303, 12, 'Дюк Ростислав', ''),
(304, 12, 'Іваник Анастасія', ''),
(305, 12, 'Іваніщев Олександр', ''),
(306, 12, 'Іванців Маркіян', ''),
(307, 12, 'Ілляш Олександр', ''),
(308, 12, 'Кісик Остап', ''),
(309, 12, 'Коваль Соломія', ''),
(310, 12, 'Коваль Софія', ''),
(311, 12, 'Костик Світлана', ''),
(312, 12, 'Куриляк Яна', ''),
(313, 12, 'Михалко Андрій', ''),
(314, 12, 'Павлів Анна', ''),
(315, 12, 'Петренко Маркіян', ''),
(316, 12, 'Проць Владислав', ''),
(317, 12, 'Радзієвська Ангеліна', ''),
(318, 12, 'Ульмер Давид', ''),
(319, 12, 'Федуняк Анастасія', ''),
(320, 12, 'Фок Степан', ''),
(321, 12, 'Фришко Іван', ''),
(322, 12, 'Харів Марта', ''),
(323, 12, 'Хоронжак Максим', ''),
(324, 12, 'Чопик Ярина', ''),
(325, 12, 'Шлярп Олег', ''),
(326, 12, 'Юринець Олександр', ''),
(327, 13, 'Андрейко Святослав', ''),
(328, 13, 'Бабіч Олег', ''),
(329, 13, 'Берло Микола', ''),
(330, 13, 'Білий Захар', ''),
(331, 13, 'Буга Каріна', ''),
(332, 13, 'Бульбах Роман', ''),
(333, 13, 'Возний Маркіян', ''),
(334, 13, 'Грицьків Марта', ''),
(335, 13, 'Дуб Марко', ''),
(336, 13, 'Жаполеу Денис', ''),
(337, 13, 'Кантор Софія', ''),
(338, 13, 'Кіцкало Яна-Марія', ''),
(339, 13, 'Кушлик Матвій', ''),
(340, 13, 'Масний Орест', ''),
(341, 13, 'Пашко Артем', ''),
(342, 13, 'Пінчук Валерія', ''),
(343, 13, 'Приступляк Роман', ''),
(344, 13, 'Семкович Владислав', ''),
(345, 13, 'Сидорик Софія', ''),
(346, 13, 'Сметаняк Святослав', ''),
(347, 13, 'Старух Владислав', ''),
(348, 13, 'Стецьків Анастасія', ''),
(349, 13, 'Сук Матвій', ''),
(350, 13, 'Танчук Марко', ''),
(351, 13, 'Тидаш Ксенія', ''),
(352, 13, 'Томенюк Марія', ''),
(353, 13, 'Фендак Максим', ''),
(354, 13, 'Хлопецький Максим', ''),
(355, 13, 'Цехон Каріна', ''),
(356, 13, 'Чайківська Магдалина', ''),
(357, 13, 'Червак Анна', ''),
(358, 13, 'Шаповал Даниїл', ''),
(359, 13, 'Яворська Єлизавета', ''),
(360, 13, 'Яцків Матвій', ''),
(361, 13, 'Яцуляк Катерина', '');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `adress`
--
ALTER TABLE `adress`
  ADD PRIMARY KEY (`ad_id`);

--
-- Індекси таблиці `class`
--
ALTER TABLE `class`
  ADD PRIMARY KEY (`cl_id`);

--
-- Індекси таблиці `document`
--
ALTER TABLE `document`
  ADD PRIMARY KEY (`d_id`);

--
-- Індекси таблиці `parants`
--
ALTER TABLE `parants`
  ADD PRIMARY KEY (`p_id`);

--
-- Індекси таблиці `stud`
--
ALTER TABLE `stud`
  ADD PRIMARY KEY (`st_id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `adress`
--
ALTER TABLE `adress`
  MODIFY `ad_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `class`
--
ALTER TABLE `class`
  MODIFY `cl_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT для таблиці `document`
--
ALTER TABLE `document`
  MODIFY `d_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `parants`
--
ALTER TABLE `parants`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблиці `stud`
--
ALTER TABLE `stud`
  MODIFY `st_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=362;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
